2m3_27mm_wall_H2_test_60/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    bottom_wall
    {
        type            noSlip;
    }
    top
    {
        type            zeroGradient;
    }
    nozzle_27mm_5mm_27cm
    {
        type            noSlip;
    }
    nozzle
    {
        // Q = 5.2 NL/min → ṁ_half = 3.895e-6 kg/s (half domain)
        // U = ṁ/(ρ·A) = 3.895e-6 / (0.08583 × π/2×(0.0135)²) = 0.16 m/s
        // ρ_H2 = 0.08583 kg/m³ at T=286.15 K, P=101325 Pa
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0 0 0))
            (0.5    (0 0 0.16))
            (100.0  (0 0 0.16))
        );
        value           uniform (0 0 0);
    }
    box_shell_2m3  //wall
    {
        type            noSlip;
    }
}
// ************************************************************************* //
