2m3_27mm_wall_H2_test_60/system/topoSetDict.removeCells
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Select cells inside the 27 mm nozzle channel to be removed.
// Nozzle length: 270 mm (0.270 m).  Keep top 27 mm (one nozzle diameter).
// Cut plane at z = 0.270 - 0.027 = 0.243 m.

actions
(
    {
        name    nozzleChannel;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        p1      (0 0 -0.001);   // slightly below floor to capture cells at z = 0
        p2      (0 0  0.243);   // cut plane: 27 mm below nozzle exit (0.270 - 0.027)
        radius  0.0135;         // inner bore radius: 27 mm diameter / 2
    }

    {
        name    fluidDomain;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     nozzleChannel;
    }
    {
        name    fluidDomain;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
